export type SeverityCategory = 'minimal' | 'mild' | 'moderate' | 'severe';

export const SEVERITY_LEVELS: Record<SeverityCategory, {
    severity: string;
    recommendation: string;
    gaugeColor: string;
    emoji: string;
}> = {
    minimal: {
        severity: 'حداقل نشانه‌های ADHD',
        recommendation: 'وضعیت شما طبیعی به نظر می‌رسد، خوش به حالتون!',
        gaugeColor: '#43a047',
        emoji: '😊',
    },
    mild: {
        severity: 'علائم خفیف',
        recommendation: 'پیگیری علائم توصیه می‌شود. در صورت اختلال در عملکرد روزانه با روانشناس مشورت کنید.',
        gaugeColor: '#fdd835',
        emoji: '🙂',
    },
    moderate: {
        severity: 'علائم متوسط',
        recommendation: 'احتمال وجود ADHD هست. ارزیابی کامل‌تر توسط متخصص توصیه می‌شود.',
        gaugeColor: '#fb8c00',
        emoji: '😐',
    },
    severe: {
        severity: 'علائم شدید',
        recommendation: 'نیاز به ارزیابی فوری توسط روانشناس یا روانپزشک وجود دارد.',
        gaugeColor: '#e53935',
        emoji: '😟',
    }
};

export const questions: string[] = [
    'هر چند وقت یک‌بار در به پایان رساندن جزئیات نهایی یک پروژه یا کار پس از اینکه بخش‌های سخت آن انجام شده‌اند، مشکل پیدا کردید؟',//
    'هر چند وقت یک‌بار هنگام انجام کاری که نیاز به سازمان‌دهی دارد، در مرتب‌سازی امور مشکل داشتید؟',//
    'هر چند وقت یک‌بار قرارها یا تعهدات خود را فراموش کردید؟',//
    'هر چند وقت یک‌بار از شروع کاری که نیاز به تمرکز ذهنی زیادی دارد خودداری یا آن را به تعویق انداختید؟',//
    'هر چند وقت یک‌بار وقتی مجبور بودید برای مدت طولانی بنشینید، دست‌ها یا پاهای خود را تکان دادید یا جابجا شدید؟',//
    'هر چند وقت یک‌بار احساس کردید بیش‌ازحد فعال هستید و انگار نیرویی درونی شما را وادار به انجام کارها می‌کند، مثل اینکه یک موتور شما را به حرکت واداشته است؟',//
    'هر چند وقت یک‌بار هنگام کار روی پروژه‌ای کسل‌کننده یا دشوار، اشتباهاتی از روی بی‌دقتی کرده‌اید؟',//
    'هر چند وقت یک‌بار هنگام انجام کارهای تکراری یا خسته‌کننده در حفظ تمرکز خود مشکل پیدا کرده‌اید؟', //
    'هر چند وقت یک‌بار حتی زمانی که افراد مستقیماً با شما صحبت می‌کنند، در تمرکز روی حرف‌هایشان مشکل پیدا کرده‌اید؟',//
    'هر چند وقت یک‌بار وسایل خود را در خانه یا محل کار گم کردید یا پیدا کردن آن‌ها برایتان دشوار بوده است؟', //
    'هر چند وقت یک‌بار حواستان توسط فعالیت‌ها یا صداهای اطراف پرت شده؟',//
    'هر چند وقت یک‌بار در جلسات یا موقعیت‌هایی که انتظار می‌رود نشسته بمانید، صندلی خود را ترک کرده‌اید؟',//
    'هر چند وقت یک‌بار احساس بی‌قراری یا بی‌تابی کرده‌اید؟',//
    'هر چند وقت یک‌بار زمانی که فرصت استراحت دارید، در آرام شدن و ریلکس‌کردن خود مشکل داشتید؟',//
    'هر چند وقت یک‌بار در موقعیت‌های اجتماعی متوجه شدید که بیش‌ازحد صحبت می‌کنید؟',//
    'وقتی در حال گفتگو هستید، هر چند وقت یک‌بار جملات طرف مقابل را قبل از اینکه خودش تمام کند، شما تمام کرده‌اید؟',//
    'هر چند وقت یک‌بار در موقعیت‌هایی که نیاز به رعایت نوبت است، در صبر کردن برای رسیدن نوبتتان مشکل داشتید؟',//
    'هر چند وقت یک‌بار زمانی که دیگران مشغول هستند، صحبت یا کارشان را قطع می‌کنید؟'
];
